[
  {
    "start_date": "2020-12-3",
    "short_description": "Bullet hell type game written in C++ using SFML as a means to display. Get the higher score possible to compete in the leaderboard! The faster you complete the map the more points you will get so be fast but be careful!",
    "course_name": "Object Oriented System",
    "long_description": "Bug Invaders is a game inspired, as the name suggests, by the classic Space Invaders. But this time it's bugs that have invaded and you are a ladybug. The goal is to kill all the enemies that have invaded your leaf as fast as possible! The faster you eliminate enemies the more points you get, but be careful these guys hurt. There are currently 2 types of enemies you have to watch out for: ants and spiders. The ants move in a synchronized pattern from left to right moving down and then up again. The ants will be constantly shooting projectiles at you. Meanwhile, the spiders will try to collide with you. As you can see there is a lot of bullets to be dodged and enemies to be kept away thankfully the ladybug is not defenseless nor slow. You can shot with the spacebar and move with the arrow keys for the more precise movement you can press the shift button to cut the movement speed in half. The playfield is set, the enemies are invading, what are you waiting for? Check out the Stats tab above for a link to GitLab! This project has taught me a lot about working on bigger projects, I have gained a deeper understanding of concepts like refactoring, good inheritance, and using IDEs. This project was challenging as the only things we used are C++ and SFML. We had to design our own game engine and state stack to change between the different states of the game and good Object Oriented Programming inheritance. I believe that I and my lab partner have designed a fun game that can be easily built upon.",
    "group_size": 2,
    "academic_credits": "8hp",
    "external_link": "https://gitlab.liu.se/kasni325/tdp005-projekt",
    "small_image": "/static/images/bugs_small.png",
    "techniques_used": [
	"C++", "SFML"
    ],
    "project_name": "Bug Invaders",
    "course_id": "TDP005",
    "end_date": "2020-10-18",
    "project_id": 1,
    "big_image": "/static/images/bugs_big.png"
  }
  
]
